glcloud/keil_v5/ARM/PACK/.Web/NXP.MK21F12_DFP.pdsc
<?xml version='1.0' encoding='UTF-8'?>
<package xmlns:xs="http://www.w3.org/2001/XMLSchema-instance" xs:noNamespaceSchemaLocation="PACK.xsd" schemaVersion="1.4">
  <vendor>NXP</vendor>
  <name>MK21F12_DFP</name>
  <description>Device Family Pack for MK21F12</description>
  <license>Licenses.txt</license>
  <url>http://mcuxpresso.nxp.com/cmsis_pack/repo/</url>
  <releases>
    <release version="10.0.1">NXP CMSIS packs based on MCUXpresso SDK 2.3.1</release>
    <release version="10.0.0">NXP CMSIS packs with updated Clear BSD license, based on MCUXpresso SDK 2.3.0. NXP CMSIS pack will maintain independent versioning starting with 10.0.0</release>
    <release version="2.3.0">NXP MCUXpresso SDK 2.3.0 CMSIS packs with updated Clear BSD license</release>
  </releases>
  <keywords>
    <keyword>Device Family Pack</keyword>
  </keywords>
  <taxonomy>
    <description Cclass="Device" Cgroup="Startup">NXP MCUXpresso SDK Device Startup</description>
    <description Cclass="Board Support" Cgroup="SDK Project Template">NXP MCUXpresso SDK Project Template</description>
    <description Cclass="Device" Cgroup="SDK Drivers">NXP MCUXpresso SDK Peripheral Drivers</description>
    <description Cclass="Device" Cgroup="SDK Project Template">NXP MCUXpresso SDK RTE Device Project Template</description>
    <description Cclass="Device" Cgroup="SDK Utilities">NXP MCUXpresso SDK Utilities</description>
  </taxonomy>
  <devices>
    <family Dfamily="MK21F12" Dvendor="NXP:11">
      <description>The Kinetis K21 120 MHz MCU family targets cost-sensitive applications requiring low-power functionality.

- Features hardware encryption and tamper detection
- Includes a rich suite of analog, communication, timing and control peripherals to accommodate a wide range of requirements
- Maximizes board space and enhances performance with minimum-length interconnections
- Provides performance efficiency with industry-leading low power
- Delivers significant BOM savings through smart on-chip integration
- Shares the comprehensive enablement and scalability of the Kinetis portfolio
&amp;lt;/ul&amp;gt;</description>
      <device Dname="MK21FN1M0xxx12">
        <processor Dcore="Cortex-M4" Dfpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK21FN1M0xxx12_flash.icf"/>
        </environment>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x100000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fff0000" size="0x010000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x010000"/>
        <algorithm name="arm/MK_P1M0.FLM" start="0x00000000" size="0x00100000" default="1"/>
        <debug svd="MK21F12.xml"/>
        <variant Dvariant="MK21FN1M0VLQ12">
          <compile header="fsl_device_registers.h" define="CPU_MK21FN1M0VLQ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK21FN1M0VLQ12/MK21FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK21FN1M0VMC12">
          <compile header="fsl_device_registers.h" define="CPU_MK21FN1M0VMC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK21FN1M0VMC12/MK21FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK21FN1M0VMD12">
          <compile header="fsl_device_registers.h" define="CPU_MK21FN1M0VMD12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK21FN1M0VMD12/MK21FN1M0xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
      <device Dname="MK21FX512xxx12">
        <processor Dcore="Cortex-M4" Dfpu="1" Dendian="Little-endian" Dclock="120000000"/>
        <environment name="iar">
          <file category="linkerfile" name="iar/MK21FX512xxx12_flash.icf"/>
        </environment>
        <memory name="FLEX_NVM" access="rx" start="0x10000000" size="0x020000"/>
        <memory name="FLEX_RAM" access="rw" start="0x14000000" size="0x1000"/>
        <memory name="PROGRAM_FLASH" access="rx" start="0x00000000" size="0x080000" startup="1" default="1"/>
        <memory name="SRAM_LOWER" access="rw" start="0x1fff0000" size="0x010000" default="1"/>
        <memory name="SRAM_UPPER" access="rw" start="0x20000000" size="0x010000"/>
        <algorithm name="arm/MKD128_4KB_SECTOR.FLM" start="0x10000000" size="0x00020000" default="1"/>
        <algorithm name="arm/MK_P512X.FLM" start="0x00000000" size="0x00080000" default="1"/>
        <debug svd="MK21F12.xml"/>
        <variant Dvariant="MK21FX512VLQ12">
          <compile header="fsl_device_registers.h" define="CPU_MK21FX512VLQ12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK21FX512VLQ12/MK21FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK21FX512VMC12">
          <compile header="fsl_device_registers.h" define="CPU_MK21FX512VMC12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK21FX512VMC12/MK21FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
        <variant Dvariant="MK21FX512VMD12">
          <compile header="fsl_device_registers.h" define="CPU_MK21FX512VMD12"/>
          <environment name="uv">
            <CMisc>--C99</CMisc>
            <LMisc>--scatter "./RTE/Device/MK21FX512VMD12/MK21FX512xxx12_flash.scf"</LMisc>
          </environment>
        </variant>
      </device>
    </family>
  </devices>
  <conditions>
    <condition id="cond_MCUXpressoConfigTools">
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <accept Dname="MK21FN1M0???12" Dvendor="NXP:11"/>
      <accept Dname="MK21FX512???12" Dvendor="NXP:11"/>
    </condition>
    <condition id="devices.MK21F12_device.MK21F12_device.MK21F12_startup_device.device_device_driver.clock_driver.common_driver.gpio_driver.port_driver.smc_driver.uart_utility.debug_console">
      <accept Dvendor="NXP:11" Dname="MK21FX512???12"/>
      <accept Dvendor="NXP:11" Dname="MK21FN1M0???12"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="flash"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="gpio"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="port"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="smc"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
      <require Cclass="Device" Cgroup="SDK Utilities" Csub="debug_console"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MK21F12_driver.dspi">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MK21FX512???12"/>
      <accept Dvendor="NXP:11" Dname="MK21FN1M0???12"/>
      <require Cclass="CMSIS Driver" Cgroup="SPI" Csub="dspi_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dspi"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MK21F12_driver.i2c">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MK21FX512???12"/>
      <accept Dvendor="NXP:11" Dname="MK21FN1M0???12"/>
      <require Cclass="CMSIS Driver" Cgroup="I2C" Csub="i2c_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="i2c"/>
    </condition>
    <condition id="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MK21F12_driver.uart">
      <require Cclass="Device" Cgroup="SDK Project Template" Csub="RTE_Device"/>
      <accept Dvendor="NXP:11" Dname="MK21FX512???12"/>
      <accept Dvendor="NXP:11" Dname="MK21FN1M0???12"/>
      <require Cclass="CMSIS Driver" Cgroup="USART" Csub="uart_cmsis" Capiversion="5.0.1"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.0.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="dmamux"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="uart"/>
    </condition>
